"""
Задание 1.	Написать программу, которая будет складывать, вычитать,
умножать или делить два числа. Числа и знак операции вводятся пользователем.
После выполнения вычисления программа не должна завершаться, а должна
запрашивать новые данные для вычислений. Завершение программы должно
выполняться при вводе символа '0' в качестве знака операции. Если пользователь
вводит неверный знак (не '0', '+', '-', '*', '/'), то программа должна
сообщать ему об ошибке и снова запрашивать знак операции.
Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.
Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ
Решите через рекурсию. В задании нельзя применять циклы.
Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calculator():
    user_number_1 = int(input('Введите первое число '))
    user_number_2 = int(input('Введите второе число '))
    user_operation = input('Введите операцию с числами: +, -, *, / или 0 для выхода ')

    if user_operation == '0':
        return 0
    elif user_operation == '+':
        print(user_number_1 + user_number_2)
        return calculator()
    elif user_operation == '-':
        print(user_number_1 - user_number_2)
        return calculator()
    elif user_operation == '*':
        print(user_number_1 * user_number_2)
        return calculator()
    elif user_operation == '/':
        try:
            print(user_number_1 / user_number_2)
            return calculator()
        except ZeroDivisionError as e:
            print('На ноль делить нельзя')
            return calculator()
    else:
        print('Вы ввели неверную операцию')
        return calculator()


calculator()
