"""
Задание 7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2
Нужно написать рекурсивную ф-цию только для левой части выражения!
Результат нужно сверить с правой частью.
Правой части выражения в рекурсивной ф-ции быть не должно!
Решите через рекурсию. В задании нельзя применять циклы.
"""

numbers_sum = 0


def even_checker(number):
    global numbers_sum
    if number == 0:
        return numbers_sum
    else:
        numbers_sum += number
        number -= 1
        return even_checker(number)


print(even_checker(5) == 5 * (5 + 1) / 2)
